Emacs/init.org
#+title: Emacs Configuration
#+date: 2026-02-15

* early-init.el

[early-init.el](https://ayatakesi.github.io/emacs/28.1/html/Early-Init-File.html) は、

** header

#+begin_src emacs-lisp :tangle early-init.el
  ;;; early-init.el -*- coding: utf-8 ; lexical-binding: t -*-
#+end_src

** init処理中

[debug-on-error](https://ayatakesi.github.io/emacs/24.5/elisp_html/Error-Debugging.html) により、エラー発生を気づけるようにする。

#+begin_src emacs-lisp :tangle early-init.el
  (setq debug-on-error t)
#+end_src

** init.orgのみの編集

#+begin_src emacs-lisp :tangle early-init.el
  (let ((x-init-org (concat user-emacs-directory "init.org"))
  		(x-init-el (concat user-emacs-directory "init.el")))
  (when (file-newer-than-file-p x-init-org x-init-el)
  	(message "WARN: init.el is old.\n")))
#+end_src


** 見た目の設定

#+begin_src emacs-lisp :tangle early-init.el
  ;; ツールバー非表示
  (tool-bar-mode 0)

  ;; スクロールバーの非表示
  (set-scroll-bar-mode nil)

  ;;  行番号の表示
  (global-display-line-numbers-mode t)
  (custom-set-variables '(display-line-numbers-width-start t))

  ;; タブの表示
  (tab-bar-mode t)

  ;; native-comp ワーニングの抑制
  (custom-set-variables '(warning-suppress-types '((comp) (native-compiler))))
  (setq native-comp-async-report-warnings-errors nil)
#+end_src

** フレーム

#+begin_src emacs-lisp :tangle early-init.el
  (setq default-frame-alist
  		(append '((width . 140) ;フレーム幅
  				  (height . 40) ; フレーム高
  				  (left . 170) ; 配置左
  				  (top . 30) ; 配置上
  				  (line-spacing . 0) ; 文字間隔
  				  (left-fringe . 12) ; 左フリンジ幅
  				  (right-fringe . 12) ; 右フリンジ幅
  				  (menu-bar-lines . 1) ; メニューバー
  				  (cursor-type . box) ; カーソル種別
  				  (alpha . 90) ; 透明度
  			  )
  			default-frame-alist))
  (setq initial-frame-alist default-frame-alist)
#+end_src


** footer

#+begin_src emacs-lisp :tangle early-init.el
  ;;; early-init.el ends here
#+end_src

* init.el

** header

#+begin_src emacs-lisp :tangle yes
;;; init.el -*-config: utf-8 ; lexical-binding: t -*-
#+end_src

** パッケージマネージャ

leaf, leaf-keywords, leaf-convert を使ってパッケージを管理する。gcmh でメモリ管理も行う。

#+begin_src emacs-lisp :tangle yes
(eval-and-compile
  (customize-set-variable
   'package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
      		("melpa" . "https://melpa.org/packages/")
      		("org" . "https://orgmode.org/elpa/")
      		("nongnu" . "https://elpa.nongnu.org/nongnu/")))
  (package-initialize)
  (use-package leaf :ensure t)

(leaf leaf-keywords
  :ensure t
  :init
  (leaf blackout :ensure t)
  :config
  ;; optional パッケージ
  (leaf hydra :ensure t)
  (leaf el-get :ensure t)
  (leaf blackout :ensure t)

  ;; leaf-keywordsの初期化
  (leaf-keywords-init)))

(leaf leaf-convert
  :doc "Convert many format to leaf format"
  :ensure t)
#+end_src

** メモリ管理

#+begin_src emacs-lisp :tangle yes
(leaf gcmh
  :ensure t
  :global-minor-mode t
  :custom
  (gcmh-verbose . t))
#+end_src

** mise パスの設定

mise (asdf 互換バージョンマネージャ) の shims パスを Emacs の PATH に追加する。

#+begin_src emacs-lisp :tangle yes
;; mise (asdf-compatible version manager) のshimsパスをEmacsのPATHに追加
;; これにより terraform など mise 管理のツールを Emacs から利用できる
(let ((mise-shims (expand-file-name "~/.local/share/mise/shims")))
  (when (file-directory-p mise-shims)
    (add-to-list 'exec-path mise-shims)
    (setenv "PATH" (concat mise-shims ":" (getenv "PATH")))))
#+end_src

** Homebrew パスの設定

Homebrew (Apple Silicon) のバイナリパスを Emacs の PATH に追加する。
claude-agent-acp など =/opt/homebrew/bin= にインストールされるツールのために必要。

#+begin_src emacs-lisp :tangle yes
;; Homebrew (Apple Silicon) のバイナリパスを追加
;; claude-agent-acp など /opt/homebrew/bin にインストールされるツールのため
(let ((homebrew-bin "/opt/homebrew/bin"))
  (when (file-directory-p homebrew-bin)
    (add-to-list 'exec-path homebrew-bin)
    (setenv "PATH" (concat homebrew-bin ":" (getenv "PATH")))))
#+end_src

** 全体設定

一般的な設定をまとめる。auto-save の保存先も設定する。

- [Lockfile](https://ayatakesi.github.io/emacs/26.2/html/Interlocking.html)による多数のユーザーによる書き込みを防ぐことはしない
- [](https://ayatakesi.github.io/emacs/24.5/elisp_html/Minibuffer-History.html)

#+begin_src emacs-lisp :tangle yes
(leaf general-settings
  :config
  (prefer-coding-system 'utf-8-unix)
  (global-set-key [mouse-2] 'mouse-yank-at-click)
  (global-unset-key "\C-z")
  (delete-selection-mode t)
  (electric-pair-mode t)
  (define-key global-map (kbd "C-{") 'hs-hide-block)
  (define-key global-map (kbd "C-}") 'hs-show-block)
  (define-key global-map (kbd "<C-tab>") 'hs-toggle-hiding)
  (add-hook 'prog-mode-hook 'hs-minor-mode)
  (setq-default bidi-paragraph-direction 'left-to-right)
  (setq bidi-inhibit-bpa t)
  (define-key global-map (kbd "C-d") 'delete-forward-char)
  (define-key global-map (kbd "C-f") 'forward-char)
  (define-key global-map (kbd "C-k") 'kill-line)
  (define-key global-map (kbd "C-e") 'move-end-of-line)
  (define-key global-map [?¥] [?\\])
(prefer-coding-system 'utf-8-unix)

  :setq
  (read-answer-short . t)
  (create-lockfiles . nil)
  (history-length . 500)
  (history-delete-duplicates . t)
  (line-move-visual . nil)
  (mouse-drag-copy-region . t)
  (backup-inhibited . t)
  (require-final-newline . t)
  (auto-save-file-name-transforms . `((".*" ,(expand-file-name "auto-save/" user-emacs-directory) t))))
  :config
  (make-directory (expand-file-name "auto-save/" user-emacs-directory) t)
#+end_src

** 外観

*** フォント

フレーム生成後にフォントを設定する。グラフィック環境のみで適用する。

#+begin_src emacs-lisp :tangle yes
(leaf :font
  :config
  (leaf nerd-icons
	:ensure t)
  (defun my/setup-fonts (&optional frame)
	(let ((target-frame (or frame (selected-frame))))
	  (with-selected-frame target-frame
		(when (display-graphic-p)
		  (let* ((ascii-family "Monaspace Neon NF")
				 (jp-family "HackGen Console NF")
				 (ascii-spec (font-spec :family ascii-family :weight 'normal))
				 (jp-spec    (font-spec :family jp-family    :weight 'normal)))
			(set-face-attribute 'default target-frame :family ascii-family :height 180)
			(set-fontset-font nil 'ascii            ascii-spec target-frame 'append)
			(set-fontset-font nil 'japanese-jisx0208 jp-spec   target-frame 'append))))))
  (add-hook 'after-make-frame-functions #'my/setup-fonts)
  (when (display-graphic-p)
	(my/setup-fonts)))
#+end_src

*** Icon

#+begin_src emacs-lisp :tangle yes
(leaf all-the-icons
  :ensure t
  :init (leaf memoize :ensure t)
  :require t
)
#+end_src

*** テーマ

テーマの見た目に `doom-themes` を使う。このとき、テーマに `doom-vibrant` を使う。
また、ベルが鳴ったとき、モードラインを点滅させる。`doom-themes-org-config`で、org-modeのネイティブなフォント問題の修正をする。

- [doom-themes](https://github.com/doomemacs/themes)
- [emacs-neotree](https://github.com/jaypei/emacs-neotree?tab=readme-ov-file)

#+begin_src emacs-lisp :tangle yes
(leaf doom-themes
  :ensure t
  :defun (doom-themes-visual-bell-config)
  :config
  (load-theme 'doom-vibrant t)
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-org-config))
#+end_src

*** モードライン

モードラインは、現在のバッファで起っている内容を表示する。Doom Modelineにより、表示させるようにする。

- [GNU Mode Line](https://www.gnu.org/software/emacs/manual/html_node/emacs/Mode-Line.html)
- [doom-modeline](https://github.com/seagle0128/doom-modeline)
- [モードラインについて考える](https://zenn.dev/lambdagonbei/articles/0bf693abee6e71)

#+begin_src emacs-lisp :tangle yes
(leaf doom-modeline
  :ensure t
  :global-minor-mode t
  :custom
  (doom-modeline-bar-width . 4)
  (doom-modeline-hub . t)
  ;; evil state などのモーダルアイコンを nerd-icons (v3 PUA-A) ではなく
  ;; ASCII テキスト (<N>/<E>/<I> 等) で表示する。
  ;; Monaspace Neon NF / HackGen Console NF は Nerd Fonts v2 のため
  ;; U+F0xxx 台のグリフが文字化け (0F0/BF8 トーフボックス) になる。
  (doom-modeline-modal-icon . nil))
#+end_src

*** ポップアップ

ポップアップされるウィンドウを `shackle-mode` を使い調整する。

- [shackle](https://depp.brause.cc/shackle/)

#+begin_src emacs-lisp :tangle yes
(leaf shackle
  :ensure t
  :global-minor-mode t
  :custom
  (shackle-rules . '(("*Backtrace*" :popup t)
					 ("*Leaf Expand*" :popup t)
					 ("Shell Command Output*" :popup t))))
#+end_src

*** ハイライト

`beacon` によって、カーソル位置をハイライトする。
`volatile-highlights` によって、ヤンクした内容をハイライトする。

- [beacon](https://github.com/Malabarba/beacon)
- [volatile-highlights](https://github.com/k-talo/volatile-highlights.el)

#+begin_src emacs-lisp :tangle yes
(leaf beacon
  :ensure t
  :config
  (when (display-graphic-p)
    (beacon-mode 1))
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (with-selected-frame frame
                (if (display-graphic-p)
                    (beacon-mode 1)
                  (beacon-mode -1))))))

(leaf volatile-highlights
  :ensure t
  :config
  (when (display-graphic-p)
    (volatile-highlights-mode 1))
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (with-selected-frame frame
                (when (display-graphic-p)
                  (volatile-highlights-mode 1))))))
#+end_src

*** 検索・置換

`anzu` を使って、モードラインに検索中のバッファ内の個数と現在の位置を(`n/m`)で表わす。

- [anzu: 検索情報をモードラインに表示](https://emacs-jp.github.io/packages/anzu)
- [anzu](https://github.com/emacsorphanage/anzu)

#+begin_src emacs-lisp :tangle yes
(leaf anzu
  :ensure t
  :global-minor-mode global-anzu-mode
  :bind
  (("M-%" . anzu-query-replace)))
#+end_src

*** ローマ字での日本語検索

migemoを使い、ローマ字で漢字など検索できるようにする。

- [migemo](https://github.com/emacs-jp/migemo)

#+begin_src emacs-lisp :tangle yes
(leaf migemo
  :ensure t
  :require t
  :defun
  (migemo-init)
  :custom
  (migemo-command . "cmigemo")
  (migemo-options . '("-q" "--emacs"))
  (migemo-dictionary . "/opt/homebrew/share/migemo/utf-8/migemo-dict")
  (migemo-user-dictionary . nil)
  (migemo-regex-dictionary . nil)
  (migemo-coding-system . 'utf-8-unix)
  :config
  (migemo-init)
  (with-eval-after-load 'skk
    (setq skk-isearch-start-mode 'utf-8)))
#+end_src

