Emacs/init.el
;;; init.el -*-config: utf-8 ; lexical-binding: t -*-

(eval-and-compile
  (customize-set-variable
   'package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
      		("melpa" . "https://melpa.org/packages/")
      		("org" . "https://orgmode.org/elpa/")
      		("nongnu" . "https://elpa.nongnu.org/nongnu/")))
  (package-initialize)
  (use-package leaf :ensure t)

(leaf leaf-keywords
  :ensure t
  :init
  (leaf blackout :ensure t)
  :config
  ;; optional パッケージ
  (leaf hydra :ensure t)
  (leaf el-get :ensure t)
  (leaf blackout :ensure t)

  ;; leaf-keywordsの初期化
  (leaf-keywords-init)))

(leaf leaf-convert
  :doc "Convert many format to leaf format"
  :ensure t)

(leaf gcmh
  :ensure t
  :global-minor-mode t
  :custom
  (gcmh-verbose . t))

;; mise (asdf-compatible version manager) のshimsパスをEmacsのPATHに追加
;; これにより terraform など mise 管理のツールを Emacs から利用できる
(let ((mise-shims (expand-file-name "~/.local/share/mise/shims")))
  (when (file-directory-p mise-shims)
    (add-to-list 'exec-path mise-shims)
    (setenv "PATH" (concat mise-shims ":" (getenv "PATH")))))

;; Homebrew (Apple Silicon) のバイナリパスを追加
;; claude-agent-acp など /opt/homebrew/bin にインストールされるツールのため
(let ((homebrew-bin "/opt/homebrew/bin"))
  (when (file-directory-p homebrew-bin)
    (add-to-list 'exec-path homebrew-bin)
    (setenv "PATH" (concat homebrew-bin ":" (getenv "PATH")))))

(leaf general-settings
  :config
  (prefer-coding-system 'utf-8-unix)
  (global-set-key [mouse-2] 'mouse-yank-at-click)
  (global-unset-key "\C-z")
  (delete-selection-mode t)
  (electric-pair-mode t)
  (define-key global-map (kbd "C-{") 'hs-hide-block)
  (define-key global-map (kbd "C-}") 'hs-show-block)
  (define-key global-map (kbd "<C-tab>") 'hs-toggle-hiding)
  (add-hook 'prog-mode-hook 'hs-minor-mode)
  (setq-default bidi-paragraph-direction 'left-to-right)
  (setq bidi-inhibit-bpa t)
  (define-key global-map (kbd "C-d") 'delete-forward-char)
  (define-key global-map (kbd "C-f") 'forward-char)
  (define-key global-map (kbd "C-k") 'kill-line)
  (define-key global-map (kbd "C-e") 'move-end-of-line)
  (define-key global-map [?¥] [?\\])
(prefer-coding-system 'utf-8-unix)

  :setq
  (read-answer-short . t)
  (create-lockfiles . nil)
  (history-length . 500)
  (history-delete-duplicates . t)
  (line-move-visual . nil)
  (mouse-drag-copy-region . t)
  (backup-inhibited . t)
  (require-final-newline . t)
  (auto-save-file-name-transforms . `((".*" ,(expand-file-name "auto-save/" user-emacs-directory) t))))
  :config
  (make-directory (expand-file-name "auto-save/" user-emacs-directory) t)

(leaf :font
  :config
  (leaf nerd-icons
	:ensure t)
  (defun my/setup-fonts (&optional frame)
	(let ((target-frame (or frame (selected-frame))))
	  (with-selected-frame target-frame
		(when (display-graphic-p)
		  (let* ((ascii-family "Monaspace Neon NF")
				 (jp-family "HackGen Console NF")
				 (ascii-spec (font-spec :family ascii-family :weight 'normal))
				 (jp-spec    (font-spec :family jp-family    :weight 'normal)))
			(set-face-attribute 'default target-frame :family ascii-family :height 180)
			(set-fontset-font nil 'ascii            ascii-spec target-frame 'append)
			(set-fontset-font nil 'japanese-jisx0208 jp-spec   target-frame 'append))))))
  (add-hook 'after-make-frame-functions #'my/setup-fonts)
  (when (display-graphic-p)
	(my/setup-fonts)))

(leaf all-the-icons
  :ensure t
  :init (leaf memoize :ensure t)
  :require t
)

(leaf doom-themes
  :ensure t
  :defun (doom-themes-visual-bell-config)
  :config
  (load-theme 'doom-vibrant t)
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-org-config))

(leaf doom-modeline
  :ensure t
  :global-minor-mode t
  :custom
  (doom-modeline-bar-width . 4)
  (doom-modeline-hub . t)
  ;; evil state などのモーダルアイコンを nerd-icons (v3 PUA-A) ではなく
  ;; ASCII テキスト (<N>/<E>/<I> 等) で表示する。
  ;; Monaspace Neon NF / HackGen Console NF は Nerd Fonts v2 のため
  ;; U+F0xxx 台のグリフが文字化け (0F0/BF8 トーフボックス) になる。
  (doom-modeline-modal-icon . nil))

(leaf shackle
  :ensure t
  :global-minor-mode t
  :custom
  (shackle-rules . '(("*Backtrace*" :popup t)
					 ("*Leaf Expand*" :popup t)
					 ("Shell Command Output*" :popup t))))

(leaf beacon
  :ensure t
  :config
  (when (display-graphic-p)
    (beacon-mode 1))
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (with-selected-frame frame
                (if (display-graphic-p)
                    (beacon-mode 1)
                  (beacon-mode -1))))))

(leaf volatile-highlights
  :ensure t
  :config
  (when (display-graphic-p)
    (volatile-highlights-mode 1))
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (with-selected-frame frame
                (when (display-graphic-p)
                  (volatile-highlights-mode 1))))))

(leaf anzu
  :ensure t
  :global-minor-mode global-anzu-mode
  :bind
  (("M-%" . anzu-query-replace)))

(leaf migemo
  :ensure t
  :require t
  :defun
  (migemo-init)
  :custom
  (migemo-command . "cmigemo")
  (migemo-options . '("-q" "--emacs"))
  (migemo-dictionary . "/opt/homebrew/share/migemo/utf-8/migemo-dict")
  (migemo-user-dictionary . nil)
  (migemo-regex-dictionary . nil)
  (migemo-coding-system . 'utf-8-unix)
  :config
  (migemo-init)
  (with-eval-after-load 'skk
    (setq skk-isearch-start-mode 'utf-8)))
