Emacs/init.el

(leaf agent-shell
  :ensure t
  :bind
  (("C-c A" . agent-shell)
   (:agent-shell-mode-map
    ("C-c s" . agent-shell-send-screenshot)
    ("C-c i" . agent-shell-send-clipboard-image)))
  :hook
  (agent-shell-mode-hook . (lambda ()
                             (when (fboundp 'evil-emacs-state)
                               (evil-emacs-state))
			     (display-line-numbers-mode -1)))
  :config
  (setq agent-shell-anthropic-authentication
        (agent-shell-anthropic-make-authentication :login t))
  (setq agent-shell-preferred-agent-config
        (agent-shell-anthropic-make-claude-code-config)))

(leaf evil
  :ensure t
  :custom
  (evil-want-integration . t)
  (evil-want-keybinding . nil)
  (evil-want-C-u-scroll . t)
  :config
  (evil-mode 1)
  (dolist (mode '(vterm-mode dired-mode magit-mode imenu-list-major-mode eat-mode agent-shell-mode))
    (evil-set-initial-state mode 'emacs)))

(leaf evil-collection
  :ensure t
  :after evil
  :custom
  (evil-collection-unimpaired-mode . nil)
  :config
  (evil-collection-init)
  (defun my/kill-region-or-backward-kill-word ()
    "リージョンが選択されていれば切り取り、そうでなければ単語を後退削除する。"
    (interactive)
    (if (use-region-p)
        (kill-region (region-beginning) (region-end))
      (backward-kill-word 1)))
  (defun my/kill-ring-save-region ()
    "リージョンまたは evil visual 選択範囲をコピーする。"
    (interactive)
    (cond
     ((and (bound-and-true-p evil-local-mode) (evil-visual-state-p))
      (let* ((range (evil-visual-range))
             (beg (nth 0 range))
             (end (nth 1 range)))
        (kill-ring-save beg end)
        (evil-normal-state)
        (message "Copied region")))
     ((use-region-p)
      (kill-ring-save (region-beginning) (region-end))
      (deactivate-mark)
      (message "Copied region"))
     (t
      (message "No region selected"))))
  ;; evil-collection 初期化後に insert モードの Emacs キーバインドを上書き
  (evil-define-key 'insert 'global (kbd "C-p") #'previous-line)
  (evil-define-key 'insert 'global (kbd "C-n") #'next-line)
  (evil-define-key 'insert 'global (kbd "C-b") #'backward-char)
  (evil-define-key 'insert 'global (kbd "C-f") #'forward-char)
  (evil-define-key 'insert 'global (kbd "C-a") #'move-beginning-of-line)
  (evil-define-key 'insert 'global (kbd "C-e") #'move-end-of-line)
  (evil-define-key 'insert 'global (kbd "M-f") #'forward-word)
  (evil-define-key 'insert 'global (kbd "M-b") #'backward-word)
  (evil-define-key 'insert 'global (kbd "C-d") #'delete-forward-char)
  (evil-define-key 'insert 'global (kbd "C-h") #'backward-delete-char)
  (evil-define-key 'insert 'global (kbd "C-k") #'kill-line)
  ;; C-w: リージョン切り取り / 単語後退削除 (insert・normal・motion・visual)
  (evil-define-key 'insert 'global (kbd "C-w") #'my/kill-region-or-backward-kill-word)
  (evil-define-key '(normal motion visual) 'global (kbd "C-w") #'my/kill-region-or-backward-kill-word)
  ;; M-w: リージョンコピー (insert・normal・motion・visual)
  (evil-define-key 'insert 'global (kbd "M-w") #'my/kill-ring-save-region)
  (evil-define-key '(normal motion visual) 'global (kbd "M-w") #'my/kill-ring-save-region)
  (evil-define-key 'insert 'global (kbd "C-y") #'yank)
  (evil-define-key 'insert 'global (kbd "M-d") #'kill-word)
  (evil-define-key 'insert 'global (kbd "C-g") #'evil-normal-state)
  ;; normal/motion モードでも C-n/C-p を evil-paste-pop-next から上書き
  (evil-define-key '(normal motion) 'global (kbd "C-n") #'next-line)
  (evil-define-key '(normal motion) 'global (kbd "C-p") #'previous-line)
  ;; ターミナルでは C-Space が C-@ (NUL) として届くため全ステートで set-mark-command に割り当て
  (evil-define-key '(normal insert motion visual) 'global (kbd "C-@") #'set-mark-command)
  (evil-define-key '(normal insert motion visual) 'global (kbd "C-SPC") #'set-mark-command)
  ;; C-TAB で括弧ブロックの折り畳みトグル
  (evil-define-key '(normal insert motion visual) 'global (kbd "<C-tab>") #'hs-toggle-hiding))

(defun my/isearch-yank-clipboard ()
  "システムクリップボードまたは kill-ring の内容を isearch に貼り付ける."
  (interactive)
  (isearch-yank-string
   (or (gui-get-selection 'CLIPBOARD 'UTF8_STRING)
       (current-kill 0 t))))

(leaf isearch
  :doc "isearch 中の次／前候補ナビゲーション"
  :bind
  (:isearch-mode-map
   ;; C-n: 次のヒットへ / C-b: 前のヒットへ
   ("C-n" . isearch-repeat-forward)
   ("C-b" . isearch-repeat-backward)
   ;; evil の C-y 上書きに対して明示的に kill-ring から貼り付け
   ("C-y" . isearch-yank-kill)
   ;; Cmd+V でシステムクリップボードから貼り付け
   ("s-v" . my/isearch-yank-clipboard)))

(leaf eat
  :ensure t
  :bind (("C-c t" . eat))
  :custom
  (eat-kill-buffer-on-exit . t)
  (eat-enable-mouse . t)

  :defun
  (ins-eat-skk-settings)
  (eat-reload-all-keymaps)

  :config
  (add-hook 'eat-mode-hook #'ins-eat-skk-settings)

  (with-eval-after-load 'eat
    (define-key eat-mode-map (kbd "C-h") (lambda ()
                                           (interactive)
                                           (eat-self-input 1 ?\177)))
    (define-key eat-mode-map "\eh" #'previous-multiframe-window)
    (define-key eat-mode-map "\el" #'next-multiframe-window)
    (define-key eat-mode-map (kbd "M-z") #'my/toggle-zoom-window)
    (define-key eat-mode-map (kbd "C-x o") #'ace-window)
    (define-key eat-semi-char-mode-map "\eh" #'previous-multiframe-window)
    (define-key eat-semi-char-mode-map "\el" #'next-multiframe-window)
    (define-key eat-mode-map (kbd "C-c C-j") #'eat-semi-char-mode))

  (with-eval-after-load 'evil
    (evil-set-initial-state 'eat-mode 'emacs))

  (defun ins-eat-skk-settings ()
    (when (fboundp 'evil-emacs-state)
      (evil-emacs-state)))

  :hook (eat-mode-hook . (lambda ()
                           (setq-local inhibit-read-only t)
                           (setq-local scroll-margin 0)
                           (display-line-numbers-mode -1)
                           (when (fboundp 'evil-emacs-state)
                                          (evil-emacs-state))
                           ))
  )

(leaf ddskk
  :ensure t
  :bind
  (("C-x C-j" . skk-mode)
   ("C-x j"   . skk-mode)
   ("M-j"     . skk-mode))
  :init
  (defvar dired-bind-jump nil) ; dired-xに `C-x C-j` が奪われてしまうので対処
  :custom
  (skk-use-azik                      . t) ; AZIKを使用
  (skk-azik-keyboard-type            . 'jp106)
  (skk-server-host                   . "localhost")
  (skk-server-portnum                . 1178)
  (skk-egg-like-newline              . t) ; 変換時にはリータンで改行しない
  (skk-japanese-message-and-error    . t)
  (skk-auto-insert-paren             . t)
  (skk-check-okurigata-on-touroku    . t)
  (skk-show-annotation               . t)
  (skk-annotation-show-wikipedia-url . t)
  (skk-show-tooltip                  . nil)
  (skk-isearch-start-mode            . 'latin)
  (skk-henkan-okuri-strictly         . nil)
  (skk-process-okuri-early           . nil)
  (skk-status-indicator              . 'minior-mode))
