Emacs/init.org
*** SKK 状態インジケータ

SKK の入力状態を 2 箇所に表示する。

1. *doom-modeline*: 通常バッファのモードラインに常時表示
2. *ミニバッファ*: プロンプト末尾にオーバーレイで表示
   （=skk-status-indicator= が =minior-mode= のままだと
   =doom-modeline-minor-modes= がデフォルト nil のため表示されないため）

| 表示 | 状態 | 色 |
|------|------|----|
| =[かな]= | ひらがなモード | 紫 |
| =[カナ]= | カタカナモード | 緑 |
| =[英数]= | 英数モード | 青 |

#+begin_src emacs-lisp :tangle yes
;; SKK 状態文字列を返すヘルパー (BUF で評価)
(defun my/skk-mode-string-in (buf)
  "BUF の SKK 状態文字列。SKK 無効時は nil."
  (with-current-buffer buf
    (cond
     ((not (bound-and-true-p skk-mode)) nil)
     ((bound-and-true-p skk-katakana)
      (propertize "[カナ]" 'face '(:foreground "#98be65" :weight bold)))
     ((bound-and-true-p skk-ascii-mode)
      (propertize "[英数]" 'face '(:foreground "#51afef" :weight bold)))
     (t
      (propertize "[かな]" 'face '(:foreground "#c678dd" :weight bold))))))

;; ① doom-modeline セグメントを定義し main modeline の右端に追加
(with-eval-after-load 'doom-modeline
  (doom-modeline-def-segment my/skk-indicator
    "SKK の入力状態."
    (my/skk-mode-string-in (current-buffer)))

  (doom-modeline-def-modeline 'main
    '(eldoc bar workspace-name window-number modals matches follow
            buffer-info remote-host buffer-position word-count parrot selection-info)
    '(compilation objed-state my/skk-indicator misc-info persp-name battery grip
                  irc mu4e gnus github debug repl lsp minor-modes input-method
                  indent-info buffer-encoding major-mode process vcs check time)))

;; ② ミニバッファ: プロンプト末尾 (minibuffer-prompt-end) にオーバーレイ
;;    呼び出し元バッファの SKK 状態を minibuffer-selected-window 経由で参照
(defvar my/skk-minibuffer-overlay nil)

(defun my/skk-minibuffer-update ()
  (when (overlayp my/skk-minibuffer-overlay)
    (let* ((win (minibuffer-selected-window))
           (buf (and win (window-buffer win)))
           (str (cond
                 ;; ミニバッファ内で SKK が有効な場合はそちらを優先
                 ((bound-and-true-p skk-mode)
                  (my/skk-mode-string-in (current-buffer)))
                 ;; 呼び出し元バッファの状態を参照
                 (buf (my/skk-mode-string-in buf)))))
      (overlay-put my/skk-minibuffer-overlay
                   'before-string
                   (if str (concat " " str) "")))))

(add-hook 'minibuffer-setup-hook
          (lambda ()
            (let ((pos (minibuffer-prompt-end)))
              (setq my/skk-minibuffer-overlay
                    (make-overlay pos pos nil t t)))
            (my/skk-minibuffer-update)
            (add-hook 'post-command-hook #'my/skk-minibuffer-update nil t)))

(add-hook 'minibuffer-exit-hook
          (lambda ()
            (when (overlayp my/skk-minibuffer-overlay)
              (delete-overlay my/skk-minibuffer-overlay))
            (setq my/skk-minibuffer-overlay nil)))
#+end_src

*** 選択範囲の拡大

`C-.` で、選択している領域を広げていく。

- [expand-region](https://github.com/magnars/expand-region.el)
- [expand-region.elの紹介](https://syohex.hatenablog.com/entry/20120117/1326814127)

#+begin_src emacs-lisp :tangle yes
(leaf expand-region
  :ensure t
  :bind (("C-." . er/expand-region))
  )
#+end_src

*** 括弧などの領域

puniにより、括弧の閉じ、開き部分を簡潔に扱えるようにする。

- [puni](https://github.com/AmaiKinono/puni)
- [Puni の汎用 Structured editing は現代エディタの標準機能](https://apribase.net/2024/06/17/emacs-puni/)

#+begin_src emacs-lisp :tangle yes
(leaf puni
  :ensure t
  :global-minor-mode puni-global-mode)
#+end_src

*** スマート改行（括弧展開）

括弧の内側でEnterを押したとき、カーソルをインデントした新しい行に置き、閉じ括弧をその下の適切な位置に移動する。prog-mode でキーバインドを設定する。

#+begin_src emacs-lisp :tangle yes
(defun my/newline-and-indent-pair ()
  "括弧の間でEnterを押したとき、括弧を展開してインデントする。"
  (interactive)
  (let ((close (char-after)))
    (if (member (list (char-before) close)
                '((?{ ?}) (?\( ?\)) (?\[ ?\])))
        (progn
          (delete-char 1)
          (newline-and-indent)
          (let ((pos (point)))
            (newline)
            (insert close)
            (indent-according-to-mode)
            (goto-char pos)))
      (newline-and-indent))))

(add-hook 'prog-mode-hook
          (lambda ()
            (local-set-key (kbd "RET") #'my/newline-and-indent-pair)
            (when (fboundp 'evil-local-set-key)
              (evil-local-set-key 'insert (kbd "RET") #'my/newline-and-indent-pair))))
#+end_src

** 補完

*** ミニバッファの補完

verticoを使いミニバッファの補完をする。

- [vertico](https://github.com/minad/vertico)

#+begin_src emacs-lisp :tangle yes
(leaf vertico
  :ensure t
  :global-minor-mode t
  :bind
  ((:vertico-map
    ("C-z" . vertico-insert)
    ("C-l" . grugrut/up-dir)))
  :preface
  (defun grugrut/up-dir ()
    "ひとつ上のディレクトリ階層に移動する."
    (interactive)
    (let* ((orig (minibuffer-contents))
           (orig-dir (file-name-directory orig))
           (up-dir (if orig-dir (file-name-directory (directory-file-name orig-dir))))
           (target (if (and up-dir orig-dir) up-dir orig)))
      (delete-minibuffer-contents)
      (insert target)))
  :custom
  (vertico-count . 20)
  (vertico-cycle . t))
#+end_src

*** 履歴の保存

#+begin_src emacs-lisp :tangle yes
(leaf savehist
  :global-minor-mode t)
#+end_src

*** Undo履歴

- [vundo](https://github.com/casouri/vundo)

#+begin_src emacs-lisp :tangle yes
(leaf vundo
  :ensure t
)
#+end_src

*** orderless

- [orderless](https://github.com/oantolin/orderless/blob/master/README.org)
- [vertico や consult で実現されるモダンなライブプレビューミニバッファ](https://apribase.net/2024/07/18/emacs-vertico-consult/)

#+begin_src emacs-lisp :tangle yes
(leaf orderless
  :ensure t
  :custom
  (completion-styles . '(orderless)))
#+end_src

*** marginalia

- [marginalia](https://github.com/minad/marginalia)
- [vertico や consult で実現されるモダンなライブプレビューミニバッファ](https://apribase.net/2024/07/18/emacs-vertico-consult/)

#+begin_src emacs-lisp :tangle yes
(leaf marginalia
  :ensure t
  :global-minor-mode t)
#+end_src

*** 関数候補の絞り込み

consultを使いミニバッファで利用可能な関数を表示するようにする。

- [consult](https://github.com/minad/consult)
- [vertico や consult で実現されるモダンなライブプレビューミニバッファ](https://apribase.net/2024/07/18/emacs-vertico-consult/)

#+begin_src emacs-lisp :tangle yes
(leaf consult
  :ensure t
  :bind
  (([remap switch-to-buffer] . consult-buffer)
   ([remap goto-line] . consult-goto-line)
   ([remap yank-pop] . consult-yank-pop)
   ("C-;" . consult-buffer)))
#+end_src

** Org-mode

タスク管理に org-mode を使う。ファイルは用途別ディレクトリで管理する。
=book/= と =research/= は 1 エントリ 1 ファイル制。

#+begin_example
~/org/
├── gcal.org               # Google Calendar 同期（自動生成）
├── archive.org            # 完了タスクのアーカイブ
│
├── book/                  # 本ごとに 1 ファイル (C-c o b で作成)
│   └── <slug>.org
│
├── personal/
│   ├── tasks.org          # 個人タスク
│   └── journal.org        # 日記・振り返り
│
├── research/              # トピックごとに 1 ファイル (C-c o r で作成)
│   └── <slug>.org
│
├── shared/
│   ├── memo.org           # デフォルトキャプチャ★
│   └── meetings.org       # ミーティングメモ・議事録
│
└── work/
    ├── tasks.org          # 業務タスク
    ├── projects.org       # プロジェクト管理
    └── notes.org          # 業務メモ・TIL
#+end_example

アジェンダ対象: =shared/memo.org=, =work/tasks.org=, =work/projects.org=,
=personal/tasks.org=, =book/= (ディレクトリ), =research/= (ディレクトリ), =gcal.org=

