Emacs/init.el

;; SKK 状態文字列を返すヘルパー (BUF で評価)
(defun my/skk-mode-string-in (buf)
  "BUF の SKK 状態文字列。SKK 無効時は nil."
  (with-current-buffer buf
    (cond
     ((not (bound-and-true-p skk-mode)) nil)
     ((bound-and-true-p skk-katakana)
      (propertize "[カナ]" 'face '(:foreground "#98be65" :weight bold)))
     ((bound-and-true-p skk-ascii-mode)
      (propertize "[英数]" 'face '(:foreground "#51afef" :weight bold)))
     (t
      (propertize "[かな]" 'face '(:foreground "#c678dd" :weight bold))))))

;; ① doom-modeline セグメントを定義し main modeline の右端に追加
(with-eval-after-load 'doom-modeline
  (doom-modeline-def-segment my/skk-indicator
    "SKK の入力状態."
    (my/skk-mode-string-in (current-buffer)))

  (doom-modeline-def-modeline 'main
    '(eldoc bar workspace-name window-number modals matches follow
            buffer-info remote-host buffer-position word-count parrot selection-info)
    '(compilation objed-state my/skk-indicator misc-info persp-name battery grip
                  irc mu4e gnus github debug repl lsp minor-modes input-method
                  indent-info buffer-encoding major-mode process vcs check time)))

;; ② ミニバッファ: プロンプト末尾 (minibuffer-prompt-end) にオーバーレイ
;;    呼び出し元バッファの SKK 状態を minibuffer-selected-window 経由で参照
(defvar my/skk-minibuffer-overlay nil)

(defun my/skk-minibuffer-update ()
  (when (overlayp my/skk-minibuffer-overlay)
    (let* ((win (minibuffer-selected-window))
           (buf (and win (window-buffer win)))
           (str (cond
                 ;; ミニバッファ内で SKK が有効な場合はそちらを優先
                 ((bound-and-true-p skk-mode)
                  (my/skk-mode-string-in (current-buffer)))
                 ;; 呼び出し元バッファの状態を参照
                 (buf (my/skk-mode-string-in buf)))))
      (overlay-put my/skk-minibuffer-overlay
                   'before-string
                   (if str (concat " " str) "")))))

(add-hook 'minibuffer-setup-hook
          (lambda ()
            (let ((pos (minibuffer-prompt-end)))
              (setq my/skk-minibuffer-overlay
                    (make-overlay pos pos nil t t)))
            (my/skk-minibuffer-update)
            (add-hook 'post-command-hook #'my/skk-minibuffer-update nil t)))

(add-hook 'minibuffer-exit-hook
          (lambda ()
            (when (overlayp my/skk-minibuffer-overlay)
              (delete-overlay my/skk-minibuffer-overlay))
            (setq my/skk-minibuffer-overlay nil)))

(leaf expand-region
  :ensure t
  :bind (("C-." . er/expand-region))
  )

(leaf puni
  :ensure t
  :global-minor-mode puni-global-mode)

(defun my/newline-and-indent-pair ()
  "括弧の間でEnterを押したとき、括弧を展開してインデントする。"
  (interactive)
  (let ((close (char-after)))
    (if (member (list (char-before) close)
                '((?{ ?}) (?\( ?\)) (?\[ ?\])))
        (progn
          (delete-char 1)
          (newline-and-indent)
          (let ((pos (point)))
            (newline)
            (insert close)
            (indent-according-to-mode)
            (goto-char pos)))
      (newline-and-indent))))

(add-hook 'prog-mode-hook
          (lambda ()
            (local-set-key (kbd "RET") #'my/newline-and-indent-pair)
            (when (fboundp 'evil-local-set-key)
              (evil-local-set-key 'insert (kbd "RET") #'my/newline-and-indent-pair))))

(leaf vertico
  :ensure t
  :global-minor-mode t
  :bind
  ((:vertico-map
    ("C-z" . vertico-insert)
    ("C-l" . grugrut/up-dir)))
  :preface
  (defun grugrut/up-dir ()
    "ひとつ上のディレクトリ階層に移動する."
    (interactive)
    (let* ((orig (minibuffer-contents))
           (orig-dir (file-name-directory orig))
           (up-dir (if orig-dir (file-name-directory (directory-file-name orig-dir))))
           (target (if (and up-dir orig-dir) up-dir orig)))
      (delete-minibuffer-contents)
      (insert target)))
  :custom
  (vertico-count . 20)
  (vertico-cycle . t))

(leaf savehist
  :global-minor-mode t)

(leaf vundo
  :ensure t
)

(leaf orderless
  :ensure t
  :custom
  (completion-styles . '(orderless)))

(leaf marginalia
  :ensure t
  :global-minor-mode t)

(leaf consult
  :ensure t
  :bind
  (([remap switch-to-buffer] . consult-buffer)
   ([remap goto-line] . consult-goto-line)
   ([remap yank-pop] . consult-yank-pop)
   ("C-;" . consult-buffer)))
