Emacs/init.el

(defun my/org-slugify (str)
  "STR をファイル名に使える文字列に変換する."
  (let* ((s (string-trim str))
         (s (replace-regexp-in-string "\\s-+" "_" s))
         (s (replace-regexp-in-string "[/\\\\:*?\"<>|]" "" s)))
    (if (string-empty-p s) "untitled" s)))

(defun my/org-new-book ()
  "読書ノートを新規作成して開く。既存ファイルはそのまま開く."
  (interactive)
  (let* ((title  (read-string "タイトル: "))
         (author (read-string "著者: "))
         (slug   (my/org-slugify title))
         (file   (expand-file-name (concat slug ".org") "~/org/book/")))
    (find-file file)
    (when (= (buffer-size) 0)
      (insert (format "#+title: %s\n#+author: %s\n#+filetags: :book:\n\n" title author))
      (insert (format "* TODO Read\n  CREATED: %s\n\n"
                      (format-time-string "[%Y-%m-%d %a %H:%M]")))
      (insert "* Notes\n\n")
      (insert "* Review\n")
      (save-buffer))))

(defun my/org-new-research ()
  "リサーチトピックを新規作成して開く。既存ファイルはそのまま開く."
  (interactive)
  (let* ((topic (read-string "トピック: "))
         (slug  (my/org-slugify topic))
         (file  (expand-file-name (concat slug ".org") "~/org/research/")))
    (find-file file)
    (when (= (buffer-size) 0)
      (insert (format "#+title: %s\n#+filetags: :research:\n\n" topic))
      (insert "* Overview\n\n")
      (insert (format "* TODO Tasks\n  CREATED: %s\n\n"
                      (format-time-string "[%Y-%m-%d %a %H:%M]")))
      (insert "* Notes\n\n")
      (insert "* References\n")
      (save-buffer))))

(defun my/org-select-book-file ()
  "book/ 内の org ファイルを completing-read で選択して返す."
  (let* ((dir   (expand-file-name "~/org/book/"))
         (files (when (file-directory-p dir)
                  (directory-files dir t "\\.org\\'" t)))
         (names (mapcar (lambda (f) (cons (file-name-base f) f)) files))
         (sel   (completing-read "Book: " names nil t)))
    (cdr (assoc sel names))))

(defun my/org-select-research-file ()
  "research/ 内の org ファイルを completing-read で選択して返す."
  (let* ((dir   (expand-file-name "~/org/research/"))
         (files (when (file-directory-p dir)
                  (directory-files dir t "\\.org\\'" t)))
         (names (mapcar (lambda (f) (cons (file-name-base f) f)) files))
         (sel   (completing-read "Research: " names nil t)))
    (cdr (assoc sel names))))

(global-set-key (kbd "C-c o b") #'my/org-new-book)
(global-set-key (kbd "C-c o r") #'my/org-new-research)

(defvar my/org-sync-timer nil
  "org 自動同期のデバウンスタイマー.")

(defun my/org-sync ()
  "~/org を GitHub へ非同期で同期する."
  (interactive)
  (let ((script (expand-file-name "~/.conf/scripts/org-sync.sh")))
    (if (not (file-executable-p script))
        (message "org-sync: script not found: %s" script)
      (message "org sync: starting...")
      (set-process-sentinel
       (start-process "org-sync" "*org-sync*" script)
       (lambda (_proc event)
         (cond
          ((string-match "finished" event) (message "org sync: done"))
          ((string-match "exited abnormally" event)
           (message "org sync: failed — see *org-sync* buffer"))))))))

(defun my/org-sync-debounced ()
  "保存から 5 秒後に org sync を実行する（連続保存をまとめる）."
  (when my/org-sync-timer
    (cancel-timer my/org-sync-timer))
  (setq my/org-sync-timer
        (run-with-timer 5 nil #'my/org-sync)))

(add-hook 'after-save-hook
          (lambda ()
            (when (and (buffer-file-name)
                       (string-suffix-p ".org" (buffer-file-name))
                       (string-prefix-p (expand-file-name "~/org/")
                                        (expand-file-name (buffer-file-name))))
              (my/org-sync-debounced))))

(global-set-key (kbd "C-c o s") #'my/org-sync)

(leaf org
  :ensure t
  :bind
  (("C-c a" . org-agenda)
   ("C-c c" . org-capture)
   ("C-c l" . org-store-link))
  :custom
  ;; ファイル
  (org-directory . "~/org")
  (org-agenda-files . '("~/org/shared/memo.org"
                        "~/org/work/tasks.org"
                        "~/org/work/projects.org"
                        "~/org/personal/tasks.org"
                        "~/org/book"
                        "~/org/research"))
  (org-default-notes-file . "~/org/shared/memo.org")
  ;; TODO ステート
  (org-todo-keywords
   . '((sequence "TODO(t)" "IN-PROGRESS(i!)" "|" "DONE(d!)" "CANCELLED(c@)")))
  (org-todo-keyword-faces
   . '(("TODO"        . (:foreground "#ff6c6b" :weight bold))
       ("IN-PROGRESS" . (:foreground "#ecbe7b" :weight bold))
       ("DONE"        . (:foreground "#98be65" :weight bold))
       ("CANCELLED"   . (:foreground "#5b6268" :weight bold))))
  ;; ログ
  (org-log-done . 'time)
  (org-log-into-drawer . t)
  ;; アジェンダ
  (org-agenda-span . 'week)
  (org-agenda-start-on-weekday . 1)
  (org-agenda-window-setup . 'current-window)
  ;; 外観
  (org-startup-indented . t)
  (org-hide-leading-stars . t)
  (org-ellipsis . " ▾")
  ;; アーカイブ
  (org-archive-location . "~/org/archive.org::* Archive")
  (org-modules . '(ol-bbdb ol-bibtex ol-docview ol-info ol-irc ol-mhe ol-rmail ol-w3m))
  :config
  (setq org-capture-templates
        '(("m" "Memo" entry
           (file+headline "~/org/shared/memo.org" "Memo")
           "* %?\n  CREATED: %U\n  %i\n  %a"
           :empty-lines 1)
          ("w" "Work Task" entry
           (file+headline "~/org/work/tasks.org" "Tasks")
           "* TODO %?\n  CREATED: %U\n  %i\n  %a"
           :empty-lines 1)
          ("W" "Work Note" entry
           (file+headline "~/org/work/notes.org" "Notes")
           "* %?\n  CREATED: %U\n  %i\n  %a"
           :empty-lines 1)
          ("p" "Personal Task" entry
           (file+headline "~/org/personal/tasks.org" "Tasks")
           "* TODO %?\n  CREATED: %U\n  %i\n  %a"
           :empty-lines 1)
          ("j" "Journal" entry
           (file+olp+datetree "~/org/personal/journal.org")
           "* %?\n  CREATED: %U"
           :empty-lines 1)
          ("b" "Book Note" entry
           (file+headline my/org-select-book-file "Notes")
           "** %T\n   %?"
           :empty-lines 1)
          ("r" "Research Note" entry
           (file+headline my/org-select-research-file "Notes")
           "** %T\n   %?"
           :empty-lines 1)
          ("M" "Meeting" entry
           (file+headline "~/org/shared/meetings.org" "Meetings")
           "* %^{タイトル} %^g\n  DATE: %T\n  出席: %^{出席者}\n\n** Agenda\n  %?\n\n** Actions\n"
           :empty-lines 1)))
  (with-eval-after-load 'evil
    (evil-define-key 'normal org-mode-map
      (kbd "TAB") #'org-cycle
      (kbd "RET") #'org-open-at-point
      (kbd "t")   #'org-todo
      (kbd "T")   #'org-set-tags-command
      (kbd ">")   #'org-deadline
      (kbd "<")   #'org-schedule
      (kbd "gh")  #'outline-up-heading
      (kbd "gj")  #'org-forward-heading-same-level
      (kbd "gk")  #'org-backward-heading-same-level
      (kbd "gl")  #'outline-next-heading)
    ;; evil の全ステートで M-h/M-l によるウィンドウ移動を有効にする
    ;; define-key org-mode-map だけでは evil のキーマップ階層に埋もれるため
    (evil-define-key '(normal insert visual motion emacs) org-mode-map
      (kbd "M-h") #'previous-multiframe-window
      (kbd "M-l") #'next-multiframe-window))
  ;; ディレクトリ作成
  (dolist (dir '("~/org/book" "~/org/personal"
                 "~/org/research" "~/org/shared" "~/org/work"))
    (make-directory (expand-file-name dir) t)))
