Emacs/init.el

;; GCP Secret Manager からシークレットを取得するヘルパー（セッション中キャッシュ）
(defvar my/gcloud-secret-cache (make-hash-table :test 'equal))

(defun my/gcloud-secret (secret-name)
  "GCP Secret Manager から SECRET-NAME の最新バージョンを取得する。
取得結果はセッション中にキャッシュされる。gcloud CLI の認証が必要。"
  (or (gethash secret-name my/gcloud-secret-cache)
      (let ((result (string-trim
                     (shell-command-to-string
                      (format "gcloud secrets versions access latest --secret=%s --project=aquamarine-cloud-org-mng 2>/dev/null"
                              (shell-quote-argument secret-name))))))
        (if (string-empty-p result)
            (progn
              (message "my/gcloud-secret: '%s' の取得に失敗（gcloud の認証状態を確認）"
                       secret-name)
              nil)
          (puthash secret-name result my/gcloud-secret-cache)
          result))))

(leaf org-gcal
  :ensure t
  :custom
  ;; カレンダー ID → 同期先 org ファイルのマッピング
  ;; カレンダー ID は Google Calendar の設定→「カレンダーの統合」で確認できる
  (org-gcal-fetch-file-alist . '(("atsushi@aquamarine-cloud.net" . "~/org/gcal.org")))
  :config
  ;; GCP Secret Manager から認証情報を取得してセット
  (let ((id     (my/gcloud-secret "org-gcal-client-id"))
        (secret (my/gcloud-secret "org-gcal-client-secret")))
    (if (and id secret)
        (setq org-gcal-client-id     id
              org-gcal-client-secret secret)
      (display-warning 'org-gcal
                       "GCP Secret Manager から認証情報を取得できませんでした。\
gcloud auth login / gcloud auth application-default login を確認してください。"
                       :warning)))
  ;; gcal.org を org-agenda の対象に追加
  (add-to-list 'org-agenda-files "~/org/gcal.org")
  ;; org-agenda を開いたときに自動フェッチ
  (add-hook 'org-agenda-mode-hook #'org-gcal-fetch))

(leaf avy
  :ensure t
  :bind
  (("C-:" . avy-goto-char-timer)
   ("C-*" . avy-resume)
   ("M-g M-g" . avy-goto-line))
  :config
  (leaf avy-zap
    :ensure t
    :bind
    ([remap zap-to-char] . avy-zap-to-char)))

(leaf ace-window
  :ensure t
  :bind
  (("C-x o" . ace-window))
  :config
  (setopt aw-keys '(?a ?s ?d ?f ?g ?h ?i ?j ?k ?l))
  :custom-face
  (aw-leading-char-face . '((t (:height 3.0)))))

(leaf winum
  :ensure t
  :bind
  (("M-1" . winum-select-window-1)
   ("M-2" . winum-select-window-2)
   ("M-3" . winum-select-window-3)
   ("M-4" . winum-select-window-4)
   ("M-5" . winum-select-window-5)
   ("M-6" . winum-select-window-6)
   ("M-7" . winum-select-window-7)
   ("M-8" . winum-select-window-8)
   ("M-9" . winum-select-window-9))
  :config
  (with-no-warnings (winum-mode 1)))

(defvar my/zoom-window-config nil
  "Saved window configuration before zoom.")

(defun my/toggle-zoom-window ()
  "Toggle zoom of current window like tmux C-z."
  (interactive)
  (if my/zoom-window-config
      (progn
        (set-window-configuration my/zoom-window-config)
        (setq my/zoom-window-config nil))
    (setq my/zoom-window-config (current-window-configuration))
    (delete-other-windows)))

(global-set-key (kbd "M-z") #'my/toggle-zoom-window)
(with-eval-after-load 'evil
  (evil-define-key '(normal insert visual motion emacs) 'global
    (kbd "M-z") #'my/toggle-zoom-window))

(leaf-keys (("C-h" . backward-delete-char)
            ("M-h" . previous-multiframe-window)
            ("M-l" . next-multiframe-window)
            ("C-c h" . describe-bindings)
            ("C-c H" . my/show-keybindings)))

(defun my/show-keybindings ()
  "Emacs/docs/operations.md を Markdown プレビューで表示する."
  (interactive)
  (let* ((conf-dir (file-name-directory
                    (directory-file-name
                     (file-name-directory (or load-file-name buffer-file-name
                                              (expand-file-name "~/.emacs.d/init.el"))))))
         (ops-file (expand-file-name "Emacs/docs/operations.md" conf-dir))
         (fallback (expand-file-name "~/.conf/Emacs/docs/operations.md"))
         (target (cond ((file-exists-p ops-file) ops-file)
                       ((file-exists-p fallback) fallback))))
    (if target
        (with-current-buffer (find-file-noselect target)
          (my/markdown-preview))
      (message "operations.md が見つかりません: %s" ops-file))))

(leaf which-key
  :global-minor-mode t)

(leaf magit
  :ensure t
  :bind
  (("C-x g" . magit-status)))

(leaf recentf
  :init
  (recentf-mode)
  :config
  (setopt recentf-max-saved-items 5000)
  (setopt recentf-auto-cleanup 'never))

(leaf git-gutter
  :ensure t
  :global-minor-mode global-git-gutter-mode
  :custom
  ((git-gutter:added-sign . "++")
   (git-gutter:deleted-sign . "--")
   (git-gutter:modified-sign . "==")))

(leaf treesit
  :config
  (setopt treesit-font-lock-level 4)
  (setopt treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
)

(leaf eglot
  :config
  (dolist (hook '(typescript-mode-hook
                  tsx-ts-mode-hook
                  go-mode-hook
                  go-ts-mode-hook
