Emacs/init.org
*** eglot

eglot で LSP を利用する。terraform-ls も設定する。

- [Emacs で LSP を活用してみる](https://qiita.com/blue0513/items/acc962738c7f4da26656)

#+begin_src emacs-lisp :tangle yes
(leaf eglot
  :config
  (dolist (hook '(typescript-mode-hook
                  tsx-ts-mode-hook
                  go-mode-hook
                  go-ts-mode-hook
                  python-mode-hook
                  python-ts-mode-hook
                  html-mode-hook
                  terraform-mode-hook))
    (add-hook hook #'eglot-ensure))
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '(terraform-mode . ("terraform-ls" "serve")))
    ;; TypeScript: プロジェクト内エクスポートの補完とauto-importを有効化
    (defun my/eglot-ts-workspace-config ()
      (setq-local eglot-workspace-configuration
                  '(:typescript (:suggest (:autoImports t
                                           :includeCompletionsForModuleExports t
                                           :completeFunctionCalls t))
                    :javascript (:suggest (:autoImports t
                                           :includeCompletionsForModuleExports t)))))
    (dolist (hook '(typescript-mode-hook typescript-ts-mode-hook tsx-ts-mode-hook
                    js-mode-hook js-ts-mode-hook))
      (add-hook hook #'my/eglot-ts-workspace-config))
    ;; ddskk との競合修正: SKK の変換操作が after-change-functions をスキップする
    ;; ケースで before-change が記録した生エントリ (lsp-beg lsp-end (pos . marker) ...)
    ;; が JSON シリアライズ時に cons cell として渡されエラーになる問題を回避する。
    ;; 未処理エントリを検出したら eglot の :emacs-messup フルシンクにフォールバック。
    (advice-add 'eglot--signal-textDocument/didChange :before
      (lambda ()
        (when (and (listp eglot--recent-changes)
                   (cl-some (lambda (change)
                              (consp (nth 2 change)))
                            eglot--recent-changes))
          (setq eglot--recent-changes :emacs-messup))))))
#+end_src

*** タグジャンプ (xref)

xref のバックエンドに dumb-jump を追加し、LSP が使えないファイルでも定義ジャンプができるようにする。
consult-xref で候補表示を vertico UI に統合し、evil の =gd= / =gr= にもバインドする。

**** 使い方

**基本操作（Emacs / evil normal モード共通）**

| キー           | コマンド                   | 説明                                         |
|--------------|--------------------------|----------------------------------------------|
| =M-.=          | =xref-find-definitions=    | カーソル下の識別子の定義へジャンプ             |
| =M-?=          | =xref-find-references=     | カーソル下の識別子が使われている箇所を一覧表示 |
| =M-,=          | =xref-go-back=             | ジャンプ前の位置へ戻る                         |

**evil normal モード専用**

| キー   | コマンド                  | 説明                                         |
|-------|-------------------------|----------------------------------------------|
| =gd=   | =xref-find-definitions=   | 定義へジャンプ（=M-.= と同じ）                 |
| =gr=   | =xref-find-references=    | 参照を一覧表示（=M-?= と同じ）                 |
| =C-t=  | =xref-go-back=            | ジャンプ前の位置へ戻る（=M-,= と同じ）         |

**候補が複数あるとき（vertico ミニバッファ内）**

| キー     | 説明                             |
|---------|----------------------------------|
| =C-n/p=  | 候補を上下に移動                 |
| =RET=    | 選択した候補へジャンプ           |
| =C-g=    | キャンセル                       |

**** バックエンドの優先順位

1. *eglot（LSP）* — Go・TypeScript・Python など LSP が有効なバッファでは LSP の情報を使う
2. *dumb-jump* — LSP がない言語や設定されていないバッファでは ripgrep/grep でソースを走査して定義を探す

- [dumb-jump](https://github.com/jacktasia/dumb-jump)
- [consult](https://github.com/minad/consult)

#+begin_src emacs-lisp :tangle yes
(leaf dumb-jump
  :ensure t
  :config
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate))

(leaf xref
  :config
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref))

(with-eval-after-load 'evil
  (evil-define-key 'normal 'global
    (kbd "gd") #'xref-find-definitions
    (kbd "gr") #'xref-find-references
    (kbd "C-t") #'xref-go-back))
#+end_src

** インライン補完

*** corfu-terminal

Emacs 31 未満のターミナル環境で corfu を動作させる。

#+begin_src emacs-lisp :tangle yes
(when (< emacs-major-version 31)
  (leaf corfu-terminal
    :ensure t
    :config
    (defun my/corfu-terminal-update (frame)
      (if (display-graphic-p frame)
          (corfu-terminal-mode -1)
        (corfu-terminal-mode +1)))
    (add-hook 'after-make-frame-functions #'my/corfu-terminal-update)
    (unless (display-graphic-p)
      (corfu-terminal-mode +1))))
#+end_src

*** corfu

corfuを使い補完させる。

- [CompanyからCorfuに移行する](https://qiita.com/nobuyuki86/items/7c65456ad07b555dd67d)
- [corfu](https://github.com/minad/corfu)

#+begin_src emacs-lisp :tangle yes
(leaf corfu
  :custom ((corfu-auto . t)
           (corfu-auto-delay . 0)
           (corfu-auto-prefix . 1)
           (corfu-cycle . t)
           (corfu-on-exact-match . nil)
           (tab-always-indent . 'complete))
  :init
  (global-corfu-mode +1)

  :config
  (define-key corfu-map (kbd "TAB") #'corfu-insert)
  (define-key corfu-map (kbd "<tab>") #'corfu-insert)
  (define-key corfu-map (kbd "RET") #'corfu-insert)
  (define-key corfu-map (kbd "<return>") #'corfu-insert)

  ;; java-mode などの一部のモードではタブに `c-indent-line-or-region` が割り当てられているので、
  ;; 補完が出るように `indent-for-tab-command` に置き換える
  (defun my/corfu-remap-tab-command ()
    (global-set-key [remap c-indent-line-or-region] #'indent-for-tab-command))
  (add-hook 'java-mode-hook #'my/corfu-remap-tab-command)

  ;; ミニバッファー上でverticoによる補完が行われない場合、corfuの補完が出るようにします。
  ;; https://github.com/minad/corfu#completing-in-the-minibuffer
  (defun corfu-enable-always-in-minibuffer ()
    "Enable Corfu in the minibuffer if Vertico/Mct are not active."
    (unless (or (bound-and-true-p mct--active)
                (bound-and-true-p vertico--input))
      ;; (setq-local corfu-auto nil) ;; Enable/disable auto completion
      (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
                  corfu-popupinfo-delay nil)
      (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer 1)

  ;; lsp-modeでcorfuが起動するように設定する
  (with-eval-after-load 'lsp-mode
    (setq lsp-completion-provider :none)))
#+end_src

*** cape

補完ソースを追加する。

#+begin_src emacs-lisp :tangle yes
(leaf cape
  :ensure t
  :hook (((prog-mode
           text-mode
           conf-mode
           eglot-managed-mode) . my/set-super-capf))
  :config
  (setq cape-dabbrev-check-other-buffers nil)

  (defun my/set-super-capf (&optional arg)
    (setq-local completion-at-point-functions
                (list (cape-capf-noninterruptible
                       (cape-capf-buster
                        (cape-capf-properties
                         (cape-capf-super
                          (if arg arg (car completion-at-point-functions))
                          #'cape-dabbrev
                          #'cape-file)
                         :sort t
                         :exclusive 'no))))))

  (add-to-list 'completion-at-point-functions #'cape-file t)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev t)
  (add-to-list 'completion-at-point-functions #'cape-keyword t))
#+end_src

** スニペット

yasnippet でスニペットを管理する。

#+begin_src emacs-lisp :tangle yes
(leaf yasnippet
  :ensure t
  :blackout yas-minor-mode
  :global-minor-mode yas-global-mode
  :custom ((yas-indent-line . 'fixed))
  :config
  (define-key yas-keymap (kbd "<tab>") nil)
  (define-key yas-minor-mode-map (kbd "C-c y i") #'yas-insert-snippet)
  (define-key yas-minor-mode-map (kbd "C-c y n") #'yas-new-snippet)
  (define-key yas-minor-mode-map (kbd "C-c y v") #'yas-visit-snippet-file)
  (define-key yas-minor-mode-map (kbd "C-c y l") #'yas-describe-tables)
  (define-key yas-minor-mode-map (kbd "C-c y g") #'yas-reload-all)
  (leaf yasnippet-snippets :ensure t)
  (leaf yatemplate
    :commands (yatemplate-fill-alist)
    :ensure t
    :config
    (yatemplate-fill-alist))
  (defvar company-mode/enable-yas t
    "Enable yasnippet for all backends.")
  (defun company-mode/backend-with-yas (backend)
    (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
        backend
      (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet)))))
#+end_src

** その他

*** エラーチェック

flymakeを使い構文エラーを見つけるようにする。

- [Flymake](https://ayatakesi.github.io/emacs/27.1/html/Flymake.html)
- [Elpa flymake](https://elpa.gnu.org/packages/flymake.html)

#+begin_src emacs-lisp :tangle yes
(leaf flymake
  :global-minor-mode t)
#+end_src

*** Project

- [Project](https://ayatakesi.github.io/emacs/27.2/html/Projects.html)

#+begin_src emacs-lisp :tangle yes
(leaf project
  :custom
  (project-vc-merge-submodules . nil) ; Git Submoduleは別のプロジェクトとして扱う
  (project-vc-extra-root-markers . '("pyproject.toml" "uv.lock" "setup.py" "Pipfile")))
#+end_src

*** EditorConfig

- [EditorConfig Support](https://www.gnu.org/software/emacs/manual/html_node/emacs/EditorConfig-support.html)
- [Emacs での EditorConfig の利用に editorconfig-core-c のインストールが不要になりました](https://qiita.com/10sr/articles/5e5d9519874ea3602d96)

#+begin_src emacs-lisp :tangle yes
(leaf editorconfig
  :global-minor-mode t)
#+end_src

