Emacs/init.el
  (leaf indent-bars
    :vc (:url "https://github.com/jdtsmith/indent-bars")
    :hook
    prog-mode-hook cc-mode-hook org-mode-hook
    :config
    (require 'indent-bars-ts)
    :custom
    (indent-bars-treesit-support . t)
    (indent-bars-treesit-ignore-blank-lines-types . '("module"))
    (indent-bars-pattern . ".")
    (indent-bars-width-frac . 0.2)
    (indent-bars-pad-frac . 0.2)
    (indent-bars-color-by-depth . '(:regexp "outline-\\([0-9]+\\)" :blend 1))
    (indent-bars-highlight-current-depth . '(:pattern "." :pad 0.1 :width 0.45))))

(leaf llm
  :vc (:url "https://github.com/ahyatt/llm/tree/main")
  :require llm-gemini
  :config
  (when (file-exists-p "~/.emacs.d/secrets.el")
    (load "~/.emacs.d/secrets.el")
    (setq llm-gemini (make-llm-gemini :key gemini-api-key))
    (setq ellama-provider llm-gemini)))

(leaf ellama
  :ensure t
  :bind
  ("C-c e" . ellama-transient-main-menu)
  :custom
  (ellama-language . "Japanese"))

(leaf reformatter
  :ensure t
  :config
  (reformatter-define prettier-ts-format
    :program "prettier"
    :args (list "--stdin-filepath" (or (buffer-file-name) "dummy.ts")))
  (dolist (hook '(typescript-mode-hook
                  tsx-ts-mode-hook
                  typescript-ts-mode-hook
                  js-mode-hook
                  js-ts-mode-hook))
    (add-hook hook #'prettier-ts-format-on-save-mode)))

(leaf typescript-mode
  :ensure t
  :mode
  (("\\.ts\\'" . typescript-mode)
   ("\\.tsx\\'" . tsx-ts-mode))
  :custom
  (typescript-indent-level . 2)
  (js-indent-level . 2)
  :config
  (defun my/ts-electric-pair-angle-bracket ()
    (setq-local electric-pair-pairs
                (append electric-pair-pairs '((?< . ?>))))
    (setq-local electric-pair-text-pairs electric-pair-pairs))
  (dolist (hook '(typescript-mode-hook tsx-ts-mode-hook typescript-ts-mode-hook
                  js-mode-hook js-ts-mode-hook))
    (add-hook hook #'my/ts-electric-pair-angle-bracket)))

(leaf terraform-mode
  :ensure t
  :mode (("\\.tf\\'" . terraform-mode)
         ("\\.hcl\\'" . terraform-mode))
  :hook (terraform-mode-hook . terraform-format-on-save-mode))

(defvar my/markdown-preview-css
  "body{font-family:-apple-system,BlinkMacSystemFont,'Segoe UI',Helvetica,Arial,sans-serif;font-size:16px;line-height:1.6;color:#24292e;background:#fff;padding:32px;max-width:900px;margin:0 auto}h1,h2{border-bottom:1px solid #eaecef;padding-bottom:.3em}h1,h2,h3,h4,h5,h6{margin-top:24px;margin-bottom:16px;font-weight:600;line-height:1.25}code,tt{background-color:rgba(27,31,35,.05);border-radius:3px;font-size:85%;padding:.2em .4em}pre{background-color:#f6f8fa;border-radius:6px;font-size:85%;line-height:1.45;overflow:auto;padding:16px}pre code,pre tt{background:transparent;border:0;font-size:100%;padding:0;word-break:normal}blockquote{border-left:.25em solid #dfe2e5;color:#6a737d;padding:0 1em;margin:0 0 16px}table{border-collapse:collapse;width:100%;margin-bottom:16px}td,th{border:1px solid #dfe2e5;padding:6px 13px}tr:nth-child(2n){background-color:#f6f8fa}img{max-width:100%;box-sizing:content-box}a{color:#0366d6;text-decoration:none}a:hover{text-decoration:underline}hr{border:0;border-top:1px solid #eaecef;margin:24px 0}ul,ol{padding-left:2em;margin-bottom:16px}li+li{margin-top:.25em}"
  "GitHub 風 CSS for markdown preview.")

(defun my/markdown-preview--render (buf)
  "BUF のマークダウンを HTML に変換し、ファイルパスを返す."
  (let* ((md-tmp (unless (buffer-file-name buf)
                   (let ((f (make-temp-file "md-src-" nil ".md")))
                     (with-current-buffer buf
                       (write-region (point-min) (point-max) f))
                     f)))
         (md-file (or (buffer-file-name buf) md-tmp))
         (html-file (make-temp-file "md-preview-" nil ".html"))
         (css-file (make-temp-file "md-css-" nil ".css")))
    (write-region my/markdown-preview-css nil css-file)
    (unless (= 0 (call-process "pandoc" nil nil nil
                               "-f" "gfm"
                               "-t" "html5"
                               "--standalone"
                               "--embed-resources"
                               "--syntax-highlighting=tango"
                               (format "--css=%s" css-file)
                               "-o" html-file
                               md-file))
      (delete-file css-file)
      (when md-tmp (delete-file md-tmp))
      (error "pandoc の実行に失敗しました"))
    (delete-file css-file)
    (when md-tmp (delete-file md-tmp))
    html-file))

(defun my/markdown-preview ()
  "現在のマークダウンバッファを shr でプレビューする."
  (interactive)
  (let* ((src-buf (current-buffer))
         (html-file (my/markdown-preview--render src-buf))
         (preview-buf-name (format "*md-preview: %s*"
                                   (or (buffer-file-name src-buf)
                                       (buffer-name src-buf)))))
    (with-current-buffer (get-buffer-create preview-buf-name)
      (let ((inhibit-read-only t))
        (erase-buffer)
        (insert-file-contents html-file)
        (let ((dom (libxml-parse-html-region (point-min) (point-max))))
          (erase-buffer)
          (shr-insert-document dom)))
      (goto-char (point-min))
      (special-mode)
      (pop-to-buffer (current-buffer)))))

(define-minor-mode my/markdown-auto-preview-mode
  "保存時に自動でマークダウンプレビューを更新するマイナーモード."
  :lighter " MdPv"
  (if my/markdown-auto-preview-mode
      (add-hook 'after-save-hook #'my/markdown-preview nil t)
    (remove-hook 'after-save-hook #'my/markdown-preview t)))

(leaf markdown-mode
  :ensure t
  :mode
  (("\\.md\\'" . gfm-mode))
  :bind
  (:gfm-mode-map
   ("C-c C-v" . my/markdown-preview)
   ("C-c C-x v" . my/markdown-auto-preview-mode)))

(leaf slack
  :ensure t
  :commands (slack-start)
  :bind
  (("C-c s s" . slack-start)
   ("C-c s c" . slack-channel-select)
   ("C-c s m" . slack-im-select)
   (:slack-mode-map
    ("C-c C-j" . slack-message-write-another-buffer)))
  :custom
  (slack-buffer-emojify . t)
  (slack-prefer-current-team . t)
  :config
  (let ((token (auth-source-pick-first-password
                :host "slack-emacs-token"
                :user "atsushi@aquamarine-cloud.net"))
        (cookie (auth-source-pick-first-password
                 :host "slack-emacs-cookie"
                 :user "atsushi@aquamarine-cloud.net")))
    (when (and token cookie)
      (slack-register-team
       :name "slack"
       :default t
       :token token
       :cookie cookie))))
